declare let require: any;
import { HttpServeService } from './http-serve.service';
const moment = require('moment');

export class StateMange {
  constructor(public http: HttpServeService) {}
  // 全局状态管理
  public static getToken() {
    return window.localStorage.getItem('gx_token')
    ? window.localStorage.getItem('gx_token')
    : null;
  }

  public static getLoginState() {
    return window.localStorage.getItem('gx_token')
    ? true
    : false;
  }

  // 清除所有用户信息
  public static clearUserInfo() {
    window.localStorage.clear();
  }


  /**
   * 获取用户信息
   */
  public static getUserInfo() {
    return JSON.parse(window.localStorage.getItem('gx_userInfo'));
  }

  /**
   * 认证状态的枚举
   * @param {Number} type
   * 0 代表没有认证
   * 1 代表已经认证
   */
  public static AuthState(type: any) {
    switch (type) {
      case 0:
        return '未认证';
        break;
      case 1:
        return '已认证';
        break;
      default:
        break;
    }
  }

  /**
   * 脱敏方法
   * @param {number} type 1邮箱 2手机
   * @param {string} value 传入的值
   */
 public static desensitizationFn(type: any, value: any) {
    if (value === undefined || value === null || value === '') {
      return '';
    } else if (type === 1) {
      const font = value.split('@')[0].length > 3 ? value.split('@')[0].substr(0, 3) : value.split('@')[0];
      const end = value.split('@')[1];
      return `${font}****@${end}`;
    } else if (type === 2) {
      return value.substr(0, 3) + '****' + value.substr(9);
    }
  }

  /**
   * 获取时间差
   * @parma {string} 结束时间 endTime
   * @param {string} 开始时间 startTime
   * @param {string} 类型 1 是传入两个时间取差 2是直接和当前时间取差
   */
  public static getTimeDiff(startTime: any, endTime: any, type: any) {
    const t1 = moment(startTime);
    if (type === 1) {
      const t3 = moment(moment().format('YYYY-MM-DD HH:mm:ss'));
      if (t3.diff(t1, 'minute') > 1440) {
        return `${t3.diff(t1, 'day')}天`;
      } else if (t3.diff(t1, 'minute') > 100) {
        return `${t3.diff(t1, 'hours')}小时`;
      } else if (t3.diff(t1, 'minute') <= 100) {
        return `${t3.diff(t1, 'minute')}分钟`;
      }
    } else if (type === 2) {
      const t2 = moment(endTime);
      if (t2.diff(t1, 'minute') > 1440) {
        return `${t2.diff(t1, 'day')}天`;
      } else if (t2.diff(t1, 'minute') > 100) {
        return `${t2.diff(t1, 'hours')}小时`;
      } else if (t2.diff(t1, 'minute') <= 100) {
        return `${t2.diff(t1, 'minute')}分钟`;
      }
    }
  }

  /**
   * 获取倒计时
   * @param {int} time 倒计时的时间
   * @param {object} that this指针
   * @param {string} field this 引用的字段
   */
  public static countDown(time: any, that: any, field: any) {
    let timer = null;
    timer = setInterval(() => {
      time --;
      if (time > 60) {
        that[field] = `${Math.floor(time / 60)}分${time % 60}秒`;
      } else {
        that[field] = `${time}秒`;
      }

      if (time === 0) {
        clearInterval(timer);
      }

    }, 1000);
  }

  /**
   * 时间戳转换成普通时间格式
   */
  public static timeToComplete(timestamp: any) {
    return moment(timestamp).format('YYYY-MM-DD HH:mm:ss');
  }

  /**
   * 获取用户名称大全
   */
  public static getAllName() {
    return ['吞下余晖', '微笑', '褪了色旳回憶' , '为爱控' , '刘飞' , '张洋' , '陈飞飞' , '吴凯莉',
    '逯俊友', '牟明钰', '阎攸', '牢岚翠', '鄞秀英', '辟明德', '缪觅翠', '吉和颂', '柳骏喆', '项彭越',
    '永凝琴', '威晓', '韩伟祺', '慎莹', '谢代丝', '矫晨辰', '井泰河', '那欣艳', '斯龙', '丰孟阳',
    '于初雪', '蒙以彤', '司悠婉', '郗乐咏', '朴敏学', '哈博艺', '臧醉蝶', '拜兰泽', '章傲南', '随采薇',
    '法力勤', '箕绮文', '菅英彦', '姚江雪', '穰如波', '买慕晴', '匡香卉', '应涵梅', '翁蕊珠', '守灵波',
    '皮宇', '暴言心', '化冷松', '谬滨海', '江晓曼', '莘寻春', '从驹', '撒平文', '曹之槐', '藏光耀',
    '刘翊君', '鲁秀慧', '唐运凡', '碧仪', '党伟彦', '类夜天', '和瑰', '南门骊雪', '隗宜欣', '公和安',
    '纳喇琼思', '巩鸿振', '九教', '登雁凡', '延碧螺', '辜含双', '青碧莹', '宗新颖', '蒲迎南', '华慧语',
    '孛乐章', '载澄', '明山梅', '塞雁露', '笃沛柔', '纳濯', '白瑜', '定嘉宝', '褒卉', '祈松', '姬尔烟',
    '有明喆', '琴晴岚', '勾胤运', '彭秋阳', '频山彤', '綦梦槐', '宝香春', '蓬翠阳', '伍赡', '巫婉秀',
    '皇甫靖易', '丘天睿', '贝运菱', '侯青曼', '铎清漪', '无傲之', '光怜晴', '雍典雅', '仲若云', '常兴为',
    '求觅晴', '饶云逸', '越伟毅', '恽觅露', '捷绮琴', '隐人', '国未央', '速黛', '卯乐巧', '杜仙韵', '谭修真',
    '磨秋柳', '张简靖', '太史春雪', '韦雪翎', '符尔云', '闳怜', '校梦山', '系池', '伏曼妮', '奇易绿', '仍禄',
    '邓君', '乌孙曼音', '荀飞双', '邹又柔', '瓮惠君', '力如之', '邶煜', '宾平安', '辛雪晴', '敛雅娴', '晋雪巧',
    '舒娜', '乌雅虹颖', '池寻巧', '侨彤', '麴曼凡', '卓瀚漠', '剧代秋', '莱又松', '允驰轩', '酆惜灵', '风枫',
    '渠宛菡', '候沛容', '蹉丹亦', '富蓝尹', '改思萱', '羿念烟', '奈任', '范问丝', '韶千凡', '次文彦', '万烨烨',
    '过俊慧', '盖悦和', '员琬琰', '微生怀莲', '郭俨雅', '端诗霜', '狂碧白', '鹿闳', '禽智纯', '西门清馨', '斛音华',
    '巨艾', '管沈思', '运骊媛', '念雨文', '成良', '可运升', '卢觅荷', '卿心慈', '诗盼香', '普慧', '秦菊华', '詹碧萱',
    '尤柔丽', '邬宾白', '索烨然', '赫连春翠', '官天华', '鄂永逸', '嵇思松', '脱燕桦', '示瀚彭', '巧笑萍', '佛安安',
    '申慕', '戊木', '皇妙音', '檀沛', '庚英韶', '云家欣', '公冶璠', '卞颖', '徭澹', '仝密如', '绍月桂', '须宏硕',
    '养书双', '盛晨涛', '车月', '滕涆', '板翔', '完海白', '称柔婉', '虢傲菡', '德泽', '酒昊宇', '浑采萱', '牧乐游',
    '钞宵', '之如南', '冼佳悦', '厉童彤', '广弘', '易友槐', '严浩博', '侍小蕾', '戈斌斌', '璩正平', '笪建明',
    '桂华藏', '豆昊然', '东方小', '上官承颜', '孙宾', '勇旺', '司马玑', '亢珉瑶', '本紫丝', '俎乐天', '虞莺韵',
    '环舟', '汉山柳', '任舒方', '中醉柳', '市学智', '肖鲲', '方香巧', '梁冰绿', '阚莎莉', '营蓝', '苟夏云',
    '子车雁风', '毓布', '聊爽', '阮茉莉', '书易梦', '邝惠心', '公孙鸿信', '折慧晨', '镜婉', '同清妍', '巴赫',
    '茆骊娟', '抄佳晨', '甘承德', '迟依楠', '俟琛', '翠雯丽', '桥博远', '蔡和风', '雀友易', '景茹雪', '温英逸',
    '亓弘图', '丑雅容', '操寿', '弭悦', '山烁', '濯浩丽', '零泽民', '庹鸿朗', '农海宁', '都韶丽', '释纬',
    '董元青', '茅安琪', '首振海', '汗萦心', '靳鹏鲸', '连思雨', '岳晴波', '奚斯文', '五雨凝', '蔚亦凝',
    '雪芙蓉', '枚景福', '怀端静', '祖子童', '信骏燕', '性红叶', '游映真', '滑文茵', '寿雅唱', '弘睿达',
    '仁泰鸿', '资含玉', '谯霞姝', '少鸿晖', '牛玮艺', '佼桐华', '多宜', '承如彤', '练沛珊', '屈蕴藉', '卜怀桃', '茹诗蕾',
    '畅画', '纵天慧', '行黎昕', '廖雅爱', '终夜南', '田和豫', '马佳鸿运', '敖素洁', '扬斯年', '初秀越', '第五宵雨',
    '邗力夫', '望盼柳', '贯安南', '松文漪', '隽嫣', '通虎', '贡笑柳', '戚香彤', '焉雅娴', '诸葛怀梦', '源星华', '摩新知',
    '鱼冠宇', '帛语海', '萨湛颖', '潜翠', '佟佳荌荌', '桑水', '尧涵菡', '叔明轩', '闵元瑶', '寻清秋', '公西安卉', '苍运珹',
    '计山兰', '倪元驹', '台睿识', '史绿凝', '空颖慧', '森卿', '焦香洁', '乾娟秀', '袭倩语', '象雨信', '邵半莲', '阿含灵',
    '娄清晖', '霜友易', '杨子菡', '商雨灵', '僧琦', '储忆雪', '石文', '骑作人', '缑荡', '冠辰', '鲜青寒', '羊舌雨', '银梦',
    '伯浩漫', '北俊名', '衡晔', '贸尔蝶', '钊清润', '树伟兆', '忻谧辰', '留素昕', '诸懿', '燕初夏', '母半芹', '紫华采',
    '斋歆', '湛阳荣', '军双', '厚绮南', '程灵松', '沃吟怀', '岑经亘', '虎幼珊', '锺盼盼', '门飞白', '典碧玉', '裘娟巧',
    '郏荣', '段宏旷', '邴小萍', '召晓星', '舜灵秀', '栾代桃', '壬昊明', '弥心语', '高心诺', '勤书君', '悉初之', '水蓓',
    '劳冬易', '东谷蓝', '茂元', '公叔康裕', '扈中', '果阳焱', '袁尘', '曲昕', '镇苒苒', '单昭昭', '逄凌波', '淦亦旋',
    '将和暖', '柔迎梅', '亥芳懿', '闻人雅旋', '字彤彤', '双亦玉', '乐智阳', '洪慕山', '柯文心', '百里晏然', '邛易梦',
    '郸傲易', '吾以珊', '覃奥', '陀许', '徐梦丝', '玉醉山', '杞世英', '用灵珊', '甫天欣', '冉长卿', '祁稷', '许静云',
    '夕映菡', '公羊宏儒', '向谊', '蒿艳娇', '芮忆安', '前怜云', '呼幼仪', '涂绿竹', '喻新文', '生善和', '崇博易', '廉雅惠',
    '窦蕴涵', '浮梦露', '雷新梅', '瞿平卉', '宿雅彤', '扶痴梅', '洋宏壮', '夏安福', '闾琼', '税从', '受听筠', '帅修贤',
    '实晴美', '恭英飙', '犁靖儿', '朋浩阔', '支绮梅', '宣语林', '樊哲', '邸诗双', '能高格', '声虹颖', '繁乐蓉', '琦诗怀',
    '说齐敏', '妫灵槐', '泣怡', '闭宾实', '奕琼英', '宇文问萍', '宦赐', '巢元忠', '城媛', '止兴生', '赧飙', '世建木',
    '张廖子悦', '文弘雅', '哀夏柳', '贾俊雄', '福忆梅', '鄢芳菲', '狄浩岚', '武采白', '慕容晓山', '盈青文', '路颜骏',
    '糜尔槐', '叶冰彦', '拱闲', '赛义', '步峯', '孝新月', '艾华灿', '凤文斌', '逮秋彤', '巫马云英', '海寒香', '尉迟鑫鹏',
    '安湘灵', '费莫元绿', '盘嘉懿', '尔涵瑶', '戢夏', '段干贞韵', '休友菱', '翦涵蓄', '太叔嘉德', '由灵秋', '卫盼香',
    '禄姝丽', '闾丘静枫', '友勇军', '隋雰', '区寄波', '澹台天禄', '祭璞', '冀依晨', '旁静涵', '以珠', '萧忆之', '百尔蓝',
    '仙书文', '宛翔飞', '李宏逸', '归新雅', '昂艳芳', '诺晗日', '那拉彩', '钱运凯', '黄饮月', '相泓', '节勇锐', '闪宇',
    '歧雁丝', '羊意', '漆宛凝', '潭姝惠', '俞嘉言', '罕秋蝶', '昌月明', '励懿', '刚昌', '贰醉巧', '考女', '嘉乃心',
    '碧鲁孤兰', '南清华', '悟寻桃', '回文华', '函飞莲', '顾清悦', '平天罡', '令狐半兰', '龚弘量', '贵红云', '抗司晨',
    '屠鸿羽', '魏书蝶', '兆刚', '代玉琲', '其永昌', '尾吉', '竭涵煦', '穆灿', '衷婉慧', '强正青', '习韶华', '郯晓凡',
    '暨长钰', '堂雅达', '潮弘丽', '让曼吟', '介采枫', '香映寒', '利凯泽', '己幻珊', '泷寄瑶', '善夏彤', '智水风', '花妙双',
    '长梦泽', '荆蕴秀', '傅绮烟', '赤嘉丽', '充清秋', '黎听芹', '禾子宁', '禹痴瑶', '烟嫣然', '接尔丝', '苑飞阳', '硕辰龙',
    '却磊', '翟嘉祥', '愈雪曼', '慈良弼', '昝高逸', '赖瑜英', '势妮娜', '祝青易', '府博达', '蒯冬卉', '郁阑', '续阳曦',
    '薛智敏', '肥汉', '秘浩气', '轩辕碧菡', '尉希', '委雪瑶', '禚翠阳', '稽皓', '旷可嘉', '泉白容', '吕高懿', '进若英',
    '真半', '曾鸣', '士又琴', '邰安青', '咎思真', '封烨伟', '招睿范', '卑依然', '旗依云', '栋丝祺', '胥书兰', '葛灵珊',
    '喜沛', '野雨安', '在晓星', '达嘉懿', '龙贞静', '道凌晴', '童俊能', '尹竹月', '訾文彬', '衣凡', '范姜元', '牵瑞彩',
    '印听枫', '咸悌', '欧沛凝', '寇芷容', '仰姣', '独纯', '度嘉福', '泥灵阳', '兰芮丽', '佴彦昌', '瑞和璧', '锺离辰',
    '乔刚毅', '绪元旋', '库子濯', '宰父天逸', '钦淑贤', '嬴依波', '钟伟诚', '星寄容', '壤驷以旋', '柴敏', '熊家美',
    '夷亦云', '千念文', '邢文茵', '骆源源', '富察凌兰', '居儿', '线耀', '丁雨伯', '冯湛霞', '谌访儿', '左弘义',
    '郦琼芳', '及惠', '宫天玉', '天清淑', '铁梦菲', '后山', '夙文昌', '敬锐思', '藤谷梦', '乌雁菱', '汪正豪',
    '老蓉蓉', '洛玲琅', '阳以南', '崔怀薇', '赵鸿飞', '麦娅思', '第雅致', '建旭东', '出初夏', '师晓旋', '贲夏容',
    '端木驰海', '遇永望', '吴昆鹏', '展听安', '集怡乐', '边倩美', '佟鸿轩', '寸歆', '睦乐芸', '衅永长', '淡菲菲', '颛孙问风',
    '戏雪萍', '僪芮悦', '言成', '谷秋珊', '玄书意', '锐优瑗', '红俊逸', '米心怡', '刑叶', '圭亮', '张芝宇', '蓝惜寒',
    '隆寻绿', '麻宏深', '惠沛岚', '沈雅逸', '仪欣可', '潘映冬', '祢建安', '鲍凝雨', '睢和美', '仵琰', '章佳建树',
    '户霞辉', '南宫丹丹', '晁谷芹', '大语梦', '所余馥', '蒉傲薇', '旅平和', '义琴', '后贤惠', '伊璟', '京永春', '蒋新荣',
    '冒弘济', '盍星文', '蛮寄柔', '况嘉实', '荣乐怡', '帖冷雪', '位华晖', '费齐心', '戴尔容', '占温韦', '粟莹白', '鲜于盼晴',
    '濮痴春', '何悠柔', '康高芬', '满闵', '东郭元冬', '全初晴', '机幻天', '眭欣畅', '柏和泽', '图门修', '开瀚钰', '贺乐双',
    '么巧春', '刁馨逸', '权秋春', '礼觅', '阙康泰', '历婵娟', '修嘉平', '汤岚风', '王鸿德', '幸倚云', '公良觅儿', '纪旭辉',
    '锁芷雪', '合映秋', '斐清秋', '尚溪蓝', '夔昆', '仉天薇', '汲星瑶', '班丹南', '郁雁山', '枝奇略', '汝令慧', '左丘依凝',
    '革素', '赫海融', '荤仙', '闽鸿云', '桓嘉惠', '阴从凝', '毛邦', '宋雁易', '答晨旭', '学合瑞', '令元灵', '席葛菲',
    '万俟远', '逢曜文', '姒职君', '蔺雅容', '六阳德', '东门晓畅', '剑晓露', '伟慧巧', '春凝丹', '貊海秋', '胡吉敏', '郑向卉',
    '弓友', '凌正真', '呼延翠曼', '羽妙珍', '浦萱彤', '析杉月', '顿昶', '圣白风', '莫薇', '乙飞丹', '澄白玉', '迮才艺',
    '危凌霜', '皋芸若', '栗美华', '姓溶溶', '苌婕', '似敏慧', '甄又槐', '务跃', '漆雕芮佳', '朱丹红', '乘又蓝', '经一凡',
    '仆小谷', '丙宸', '司徒晴雪', '原雨星', '蚁驰文', '陆菀', '齐访冬', '兴芬芬', '芒平良', '粘慕雁', '御善静', '於从阳',
    '辉凝海', '别安顺', '闫香巧', '夫含娇', '謇金鹏', '表元良', '解昌勋', '波韶敏', '戎代容', '始胜', '时自珍', '卷念珍',
    '周吉', '仲孙风', '亓官宜年', '年好洁', '颜映波', '希格格', '褚易文', '布思敏', '竺夏瑶', '冷虹星'
    ];
  }
}
